In [5]:
import sqlite3
import pandas as pd
import numpy as np

In [15]:
conn = sqlite3.connect('/Users/abhishekrotti/Desktop/Python for DataScience/chinook.db')

cursor = conn.cursor()

#prepare a data frame to store results of the query execution
data = np.array(list(cursor.execute('select * from Tracks')))
df = pd.DataFrame(data)

In [16]:
df.head()

,0,1,2,3,4,5,6,7,8
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [17]:
df = df.drop(labels=[0, 2, 3, 4, 5, 6, 7, 8], axis=1)

In [20]:
df.head()

                                         1
0  For Those About To Rock (We Salute You)
1                        Balls to the Wall
2                          Fast As a Shark
3                        Restless and Wild
4                     Princess of the Dawn

In [21]:
conn.close()